/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_philo_init.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jeekpark <jeekpark@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/24 19:32:58 by jeekpark          #+#    #+#             */
/*   Updated: 2023/03/24 19:43:16 by jeekpark         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "philo.h"

int	ft_philo_init(t_info *info)
{
	//철학자 인원수대로 스레드 만드는 함수
	(void)info;
	if (0)
		return (FAILURE);
	return (SUCCESS);
}